Repository: mrRobot62/gcodebuilder
Catalog: app/translations/*/LC_MESSAGES/archiv/messages.po
Languages: de

source: Contour
de: Kontur

source: Circle 360
de: Kreis 360°

source: Circle arc
de: Kreisausschnitt

source: rectangle
de: Rechteck

source: rectanglerounded
de: Rechteck abgerundet

source: Surface
de: Oberfläche

source: Pocket
de: Tasche

source: Drilling
de: Bohren

source: download GCode to file
de: download GCode als Datei

source: For help set cursor insode editor
de: Für Hilfe, Cursor in den Editor positionieren

source: CTRL-ALT-h for help
de: CTRL-ALT-h für Hilfe

source: CMD-ALT-h for help
de: CMD-ALT-h für Hilfe

source: With this module various contours can be milled (e.g. circles, rectangles, triangle etc)
de: Mit diesem Modul können verschiedene Konturen gefräst werden (z.B. Kreise, Rechtecke, Dreiecke,...)

source: Surfaces can be milled flat with this module. Various milling paths are available
de: Planfräsen von Oberflächen. Verschieden Fräse-Bahnwege stehen zur Verfügung

source: With this module you can create holes (in circular shape, circular sections, rectangular, ...
de: Mit diesem Modul können Taschen gefräst werden (Kreistasche, Rechtecktasche, ...)

source: Diameter circle
de: Kreisdurchmesser

source: only positive number > 0 is allowed
de: nur positive Zahlen >0 sind erlaubt

source: Enter radius of circel
de: Eingabe Kreisradius

source: Radius arc
de: Radius Kreisausschnitt

source: e.g. if start angle is 225 than end angle is 315
de: z.B. Start-Winkel ist 225° und End-Winkel ist 315°

source: Start/End are symetric in a 90° angle
de: Start/Ende Winkel sind symetrisch in 90°

source: Start angle (w1)
de: Start-Winkel (w1)

source: Starting angle (w1)
de: Start-Winkel (w1)

source: End angle (w2)
de: End-Winkel (w2)

source: Ending angle (w2)
de: End-Winkel (w2)

source: Milling a 360deg circle with diameter D
de: Fräse einen Kreis mit einem Durchmesser D

source: Milling a circle arc with an angle w and an radius R
de: Färse einen Kreissauschnit mit Winkel w und Radius R

source: Rectangle
de: Rechteck

source: Milling a rectangle a x b
de: Fräse Rechteck in der Größe a*b

source: Rounded Rectangle
de: Rechteck abgerundet

source: Milling a rounded rectangel a x b with edge radius R
de: Fräse abgerundetes Rechteck a*b mit Eckenradius R

source: Rectangle width (a)
de: Rechteckbreite (a)

source: Rectangle height (b)
de: Rechteckhöhe (b)

source: Enter width of rectangle
de: Eingabe der Breite des Rechtecks

source: Enter height of rectangle
de: Eingabe der Höhe des Rechtecks

source: Define GCode sequences for Pre- or post milling
de: Erfasse GCode Sequenzen für Pre- oder Post-Fräse

source: Pre & Post Parameters
de: Pre & Post Parameter

source: Please insert Pre-GCode
de: Bitte Pre-GCode definieren

source: Please insert Post-GCode
de: Bitte Post-GCode definieren

source: define standard milling params independend of object
de: Standard-Fräse Parameter basierend auf das Objekt

source: Standard Milling Parameters
de: Standard Fräs-Parameter

source: Choose your start point
de: Auswahl Startpunkt

source: Center point of cutter
de: Mittelpunkt für Fräser

source: Origin starting point for cutter
de: Original Startpunkt der Fräse (0/0)

source: Start center point of cutter
de: Startmittlelpunkt des Fräsers

source: Choose your unit
de: Einheit auswählen

source: Choose your direction
de: Fräsrichtung auswählen

source: Movement is clockwise or counter clockwise
de: Fräsrichtung rechts(CW), links (CCW)

source: Moving direction
de: Bewegungsrichtung

source: Depth of immersion
de: Eintauchtiefe

source: Tool is online, inside or outside of contour
de: Fräse auf Kontur, ausserhalb, innerhalb der Kontur

source: Kind of movement
de: Bewegungsart

source: typical values are 0.5, 1.0, 1.5, ...
de: Typische Werte sind 0.5, 1.0, 1.5, ...

source: Depth per step
de: Eintauchtiefe pro Durchgang

source: only positive number gt 0 is allowed
de: nur positive Werte > 0 sind erlaubt

source: Max depth to mill
de: Maximale Eintauchtiefe

source: Depth total
de: Eintauchtiefe gesamt

source: Enter milling speed value for X/Y axis
de: Eingabe Geschwindigkeit für X/Y Achse

source: Feed Rapid X/Y
de: G0 Geschwindigkeit X/Y

source: Enter milling speed value for Z axis
de: Geschwindigkeit Hub Z-Achse

source: Feed Rapid Z
de: G0 Geschwindigkeit für Z

source: Enter speed value for X/Y axis
de: Eingabe Geschwindigkeit für X/Y Achse

source: Feed Linear X/Y
de: Fräsgeschwindigkeit X/Y

source: Enter speed value for Z axis
de: Fräsgeschwindigkeit für Z-Achse

source: Feed Linear Z
de: Fräsgeschwindigkeit für Z-Achse

source: Enter hight for Z before starting
de: Starthöhe Z (> 0.0)

source: Start Z-Height
de: Starthöhe Z (> 0.0)

source: Enter saftey hight for Z after milling
de: Endhöhe (Save) Z

source: Saftey Z-Height
de: Endhöhe (Save) Z

source: Set your cutter diameter
de: Fräserdurchmesser

source: only positive number gt 1.0 is allowed
de: nur positive Werte > 1.0 sind erlaubt

source: Set your tool id
de: Tool-ID

source: only positive number from 0 to 99 are allowed
de: nur positive Werte von 0 bis 99 sind erlaubt

source: Set your spindle speed
de: Spindelgeschwindigkeit (RPM)

source: only positive number from 0 to 30000 are allowed
de: nur positive Werte von 0 bis 30000 sind erlaubt

source: Recommended parameters
de: Empfohlene Parameter

source: Due to your individuell machine parameters, feed rate, infeed rate and your used spindle this recommendatoins maybe not be optimized for your setup
de: Basierend auf die individuellen Maschinenparaemter, Geschwindkeite, Eintauchtiefe und der Spindel sind nachfolgende Parameter vielleicht nicht optimal für das vorliegende Setup

source: Tool diameter
de: Werkzeugdurchmesser

source: Feed rate <br>mm/min
de: Geschwindigkeit <br>mm/min

source: Infeed rate <br>mm/min
de: Eintauchtiefe <br>mm/min

source: Specific object parameter
de: Spezifische Objektparameter

source: Generate GCode and show code
de: Generiere GCode

source: Generate GCode
de: Generiere GCode

source: Close
de: Schließen

source: Toolset & Material
de: Werkzeuge & Material

source: english
de: Englisch

source: german
de: Deutsch

source: french
de: Französisch

source: Pockets
de: Taschen

source: Set offset x
de: X-Offset

source: only positive number >= 0 is allowed
de: nur positive Werte >= 0 sind erlaubt

source: Set offset y
de: Y-Offset
